       IDENTIFICATION DIVISION.
       PROGRAM-ID.  "HelloWorld".
       AUTHOR. Guido.

       ENVIRONMENT DIVISION.
       
       DATA DIVISION.

       PROCEDURE DIVISION.
       0100-START-HERE.
           DISPLAY "Hello World!".
       STOP RUN.
       END PROGRAM "HelloWorld".
